Autodesk.Revit.DB.ViewType
An enumerated type listing available view types.

Autodesk.Revit.DB.ViewType.Internal
Revit's internal type of view
Remarks: Internal views are not available to API users

Autodesk.Revit.DB.ViewType.Rendering
Rendering type of view.

Autodesk.Revit.DB.ViewType.Walkthrough
Walk-Through type of 3D view.

Autodesk.Revit.DB.ViewType.ColumnSchedule
Column Schedule type of view.

Autodesk.Revit.DB.ViewType.PanelSchedule
Panel Schedule Report view.

Autodesk.Revit.DB.ViewType.PresureLossReport
Pressure Loss Report view.

Autodesk.Revit.DB.ViewType.LoadsReport
Loads Report view.

Autodesk.Revit.DB.ViewType.CostReport
Cost Report view.

Autodesk.Revit.DB.ViewType.SystemBrowser
The MEP system browser view.

Autodesk.Revit.DB.ViewType.ProjectBrowser
The project browser view.

Autodesk.Revit.DB.ViewType.Report
Report type of view.

Autodesk.Revit.DB.ViewType.Legend
Legend type of view.

Autodesk.Revit.DB.ViewType.DrawingSheet
Drawing sheet type of view.

Autodesk.Revit.DB.ViewType.DraftingView
Drafting type of view.

Autodesk.Revit.DB.ViewType.Schedule
Schedule type of view.

Autodesk.Revit.DB.ViewType.ThreeD
3-D type of view.

Autodesk.Revit.DB.ViewType.Detail
Detail type of view.

Autodesk.Revit.DB.ViewType.Section
Cross section type of view.

Autodesk.Revit.DB.ViewType.Elevation
Elevation type of view.

Autodesk.Revit.DB.ViewType.CeilingPlan
Reflected ceiling plan type of view.

Autodesk.Revit.DB.ViewType.AreaPlan
Area plan type of view.

Autodesk.Revit.DB.ViewType.EngineeringPlan
Structural plan or Engineering plan type of view.

Autodesk.Revit.DB.ViewType.FloorPlan
Floor plan type of view.

Autodesk.Revit.DB.ViewType.Undefined
Undefined/unspecified type of view.